'''Назначение:
Вычисление суммы элементов заданного ряда с точностью эпсилон.
Построение таблицы значений с заданным шагом.
Если за n итераций ряд не сошелся, вывести информацию об этом.
Овчинникова Анастасия
Переменные:
x - 
eps - точность
n - количество итераций
step - шаг
s - сумма
i, f, cp, sp - служебные
с - текущий член ряда
'''
from math import factorial

x = float(input('Введите x: '))
eps = float(input('Введите эпсилон: '))
n = int(input('Введите количество итераций n: '))
step = int(input('Введите шаг: '))

s = c = i =1
f = fp = 0

print('\u250C'+12*'\u2500'+'\u252C'+12*'\u2500'+'\u252C'+12*'\u2500'+'\u252C'+\
      12*'\u2500'+'\u2510')

print('\u2502'+' номер      '+'\u2502'+' Текущий    '+'\u2502'+' Х текущий  '+\
      '\u2502'+' Текущее    '+'\u2502')
print('\u2502'+' итерации   '+'\u2502'+' член ряда  '+'\u2502'+'            '+\
      '\u2502'+' значение   '+'\u2502')
print('\u2502'+12*' '+'\u2502'+12*' '+'\u2502'+12*' '+'\u2502'+' суммы      '+\
      '\u2502')
print('\u251C'+3*(12*'\u2500'+'\u253C')+12*'\u2500'+'\u2524')

while abs(c) > eps:
    if i % step == 0:
        cp = '{:0.7f}'.format(c)
        if cp == '0.0000000' and c != 0:
            cp = '{:9.3e}'.format(c)
        if len(cp)>10:
            cp = '{:9.3e}'.format(c)
        sp = '{:0.3f}'.format(s)
        if len(sp)>10:
            sp = '{:9.3e}'.format(s)
        print('\u2502' + ' ' + str(i) + (11-len(str(i)))*' ' + '\u2502'+' '+cp+\
              (11 -len(cp))*' '+ '\u2502'+\
          ' ' + str(x) + (11-len(str(x)))*' '+'\u2502'+' '+sp+(11 -len(sp))*' '\
              + '\u2502')
    i += 1
    c = (2*(x**(i-1)))/factorial(i-1)
    s += c
    if abs(c) < eps:
        if i % step == 0:
            cp = '{:0.7f}'.format(c)
            if (cp == '0.0000000' or cp == '-0.0000000')  and c != 0:
                cp = '{:9.3e}'.format(c)
            if len(cp)>10:
                cp = '{:9.3e}'.format(c)
            sp = '{:0.3f}'.format(s)
            if len(sp)>10:
                sp = '{:9.3e}'.format(s)
            print('\u2502' + ' ' + str(i) + (11-len(str(i)))*' ' + '\u2502'+\
                  ' '+cp+(11 -len(cp))*' '+ '\u2502'+\
              ' ' + str(x) + (11-len(str(x)))*' '+'\u2502'+' '+\
                  sp+(11 -len(sp))*' '+'\u2502')
    if i > n:
        if abs(c) < eps:
            fp = 1
        else:
            f = 1
        break
         
print('\u2514'+12*'\u2500'+'\u2534'+12*'\u2500'+'\u2534'+12*'\u2500'+\
      '\u2534'+12*'\u2500'+'\u2518')

if f == 0 or fp == 1:
    print('Ряд сошелся за', i, 'итераций')
else:
    print('\nРяд не сошелся за', n, 'итераций. ')
